{
	"@metadata": {
		"authors": [
			"Amire80",
			"Liuxinyu970226",
			"Robby",
			"Sam Wilson"
		]
	},
	"templatewizard-add-all": "Label of button that enables all inactive parameters.",
	"templatewizard-cancel": "Text for the cancel button that closes the dialogue window.\n{{Identical|Cancel}}",
	"templatewizard-close-dialog": "Title for the warning shown when closing the dialog when there are values in a field.",
	"templatewizard-close-dialog-body": "Explanatory text shown under {{msg-mw|templatewizard-close-dialog}}.",
	"templatewizard-close-dialog-retry": "Label for the button with which to discard any values that have been entered and close the TemplateWizard dialog.",
	"templatewizard-default": "Text appended to a parameter field's help text to show the parameter's default value. Parameter $1 is the default value.\n{{Identical|Default}}",
	"templatewizard-desc": "{{desc|name=TemplateWizard|url=https://www.mediawiki.org/wiki/Extension:TemplateWizard}}",
	"templatewizard-dialog-title": "A tooltip on a toolbar button that starts the TemplateWizard.\n\nAppears in the same section with the following:\n* {{msg-mw|wikieditor-toolbar-tool-link}}\n* {{msg-mw|wikieditor-toolbar-tool-file}}\n* {{msg-mw|wikieditor-toolbar-tool-reference}}\n* {{msg-mw|templatewizard-dialog-title}} (on wikis where the TemplateWizard extension is installed)\n\nTitle of the TemplateWizard dialog window.",
	"templatewizard-dismissible-message-close": "Tooltip for the close button that closes an info message so it's never shown again.",
	"templatewizard-help": "Text for the help link in the dialog footer.",
	"templatewizard-help-title": "Tooltip text for the help link.",
	"templatewizard-insert": "Text for the main template-insertion button.\n{{Identical|Insert}}",
	"templatewizard-invalid-title": "Error message shown when an invalid title is entered in the search field.",
	"templatewizard-invalid-values": "Error message shown when template-insertion button is clicked but there are invalid fields.\nOptions are to keep editing ({{msg-mw|templatewizard-invalid-values-edit}}) or continue anyway ({{msg-mw|templatewizard-invalid-values-insert}}).",
	"templatewizard-invalid-values-edit": "Text for button with which to return to editing the template form. Other option is {{msg-mw|templatewizard-invalid-values-insert}}.",
	"templatewizard-invalid-values-insert": "Text for button with which to ignore invalid fields and insert the template as-is. Other options is {{msg-mw|templatewizard-invalid-values-edit}}.",
	"templatewizard-no-description": "Information message shown when TemplateData exists but has no description.",
	"templatewizard-no-params-with-td": "Information message shown when TemplateData exists and there are no parameters defined in it. Parameter $1 is the URL of the TemplateData help page on MediaWiki.org.",
	"templatewizard-no-params-without-td": "Information message shown when there is no TemplateData and no raw parameters could be determined. Parameter $1 is the URL of the TemplateData help page on MediaWiki.org.",
	"templatewizard-no-templatedata": "Information message shown when the requested template does not have TemplateData, and the template's raw parameters are shown. Parameter $1 is the URL of the TemplateData help page on MediaWiki.org.",
	"templatewizard-opens-in-new-tab": "Tooltip shown for the template name link.",
	"templatewizard-parameters-optional": "Fieldset legend for the set of optional template parameters.",
	"templatewizard-parameters-required": "Fieldset legend for the set of required template parameters.",
	"templatewizard-parameters-suggested": "Fieldset legend for the set of suggested template parameters.",
	"templatewizard-placeholder-default": "Form input placeholder text that shows the parameter's default value.",
	"templatewizard-placeholder-example": "Form input placeholder text that shows an example of a value for the parameter.",
	"templatewizard-remove-all": "Label of button that removes all active and non-required parameter fields.",
	"templatewizard-remove-template": "Title of error message displayed when a template is removed when there's still a value in one of its fields.",
	"templatewizard-remove-template-body": "Message shown below {{msg-mw|templatewizard-remove-template}}.",
	"templatewizard-remove-template-retry": "Text for button that closes the remove-template error and closes the template, returning to the search form.",
	"templatewizard-search-placeholder": "Placeholder text in the template search field.",
	"templatewizard-search-feedback-message": "Text for the feedback message to inform users about template search improvements with a link to the project page.",
	"templatewizard-parambutton-add-title": "Tooltip for the button to add a field into the template editor.\n\nParameters:\n* $1 - Parameter name",
	"templatewizard-parambutton-remove-title": "Tooltip for the button to remove a field from the template editor.\n\nParameters:\n* $1 - Parameter name",
	"templatewizard-parambutton-required-title": "Tooltip for the title of a required field in the template editor.\n\nParameters:\n* $1 - Parameter name",
	"templatewizard-remove-template-title": "Tooltip for the button to discard work on the current template and go back to selecting a new template.",
	"templatewizard-link-to-template-title": "Tooltip for the button that opens the template's page in a new window",
	"templatewizard-use": "Text for the template search box selection button.\n{{Identical|Use}}"
}
